In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
import pyodbc

In [3]:
import mysql.connector

conn = mysql.connector.connect(
   host="localhost",
   user="root",
   passwd="vaishuvkb24",
    db='accidentsanalyse'
)

print(conn)

import pandas as pd
df=pd.read_sql_query("SELECT * FROM liable",conn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000020027A59550>

In [4]:
# df

In [5]:
q1=pd.read_sql_query("select v.brand,max(c.noofaccidents) from vehicletype v,casualty c where v.vehicleno=c.vehicleno group by v.brand having max(c.noofaccidents) >=ALL(select max(c.noofaccidents) from casualty c,vehicletype v group by v.brand)",conn)

In [6]:
q1

   brand  max(c.noofaccidents)
0  swift                    27

In [8]:
import tkinter  as tk 
from tkinter import *

In [10]:
q2a=pd.read_sql_query("select sum(c.noofaccidents) as accidents_by_female from liable l, casualty c,vehicletype v where l.licenseno=v.licenseno and c.vehicleno=v.vehicleno and l.sex='F'",conn)

In [11]:
q2a

   accidents_by_female
0                 60.0

In [12]:
q2b=pd.read_sql_query("select sum(c.noofaccidents) as accidents_by_male from liable l, casualty c,vehicletype v where l.licenseno=v.licenseno and c.vehicleno=v.vehicleno and l.sex='M'",conn)

In [13]:
q2b

   accidents_by_male
0              134.0

In [14]:
accidents_by_sex = pd.concat([q2a, q2b], axis=1)

In [15]:
accidents_by_sex

   accidents_by_female  accidents_by_male
0                 60.0              134.0

In [18]:
q3=pd.read_sql_query("select a.streetname,COUNT(c.noofaccidents) AS NO_OF_ACCIDENTS from casualty c,area a where c.vehicleno=a.vehicleno group by a.streetname",conn)

In [19]:
q3

      streetname  NO_OF_ACCIDENTS
0        mg road                3
1         panvel                6
2  church street                6

In [21]:
q3a=pd.read_sql_query("select sum(c.noofaccidents) as accidents_by_youngadults from liable l, casualty c,vehicletype v where l.licenseno=v.licenseno and c.vehicleno=v.vehicleno and l.age between 18 and 30",conn)

In [22]:
q3a

   accidents_by_youngadults
0                     103.0

In [23]:
q3b=pd.read_sql_query("select sum(c.noofaccidents) as accidents_by_olderadults from liable l, casualty c,vehicletype v where l.licenseno=v.licenseno and c.vehicleno=v.vehicleno and l.age between 31 and 65",conn)

In [24]:
q3b

   accidents_by_olderadults
0                      91.0

In [ ]:
import tkinter as tk
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from matplotlib.backends.backend_tkagg import FigureCanvasTkAgg
from matplotlib.figure import Figure
import random
import time

global main
root=Tk()
root.title("Accident Analysis System")
root.configure(background='black')
# Set the size of the window
root.geometry("700x350")
localtime=time.asctime(time.localtime(time.time()))
lblinfo = Label(root, font=( 'aria' ,30, 'bold' ),text="Accident Analysis System",fg="steel blue",bg="black",bd=10,anchor='w')
lblinfo.pack()
lblinfo = Label(root, font=( 'aria' ,20, ),text=localtime,fg="steel blue",bg="black",anchor=W)
lblinfo.pack()

def on_click(text):
    entry.delete(0, END)
    entry.insert(0,text)

# Add an Entry widget
entry=Entry(root, width= 25)
entry.pack()

# Add Buttons in the window
b1=tk.Button(root, bd=10 ,fg="black",font=('Times New Roman' ,8,'bold'), bg="powder blue",text= "BRAND WITH HIGHEST NUMBER OF ACCIDENTS?", command=lambda:on_click(q1['brand'].values[0]))
b1.pack()

def query2():
    data1 = {'Accidents_by_Sex': ['Male', 'Female'],
             'Number_of_Accidents': [q2b['accidents_by_male'].values[0],q2a['accidents_by_female'].values[0]]
             }
    df1 = pd.DataFrame(data1)

    figure1 = plt.Figure(figsize=(7,7), dpi=50)
    ax1 = figure1.add_subplot(111)
    bar1 = FigureCanvasTkAgg(figure1, root)
    bar1.get_tk_widget().pack(side=tk.RIGHT, fill=tk.NONE)
    df1 = df1[['Accidents_by_Sex', 'Number_of_Accidents']].groupby('Accidents_by_Sex').sum()
    df1.plot(kind='bar', legend=True, ax=ax1,color="hotpink")
    ax1.set_title('Number of Accidents: Male vs Female')

b2=tk.Button(root, bd=10 ,fg="black",font=('Times New Roman' ,8,'bold'), bg="powder blue",text= "ACCIDENTS CLASSIFICATION BASED ON SEX?", command=lambda:query2())
b2.pack()

def query4():
    data1 = {'Accidents_by_Age': ['<=30', '>30'],
             'Number_of_Accidents': [q3a['accidents_by_youngadults'].values[0],q3b['accidents_by_olderadults'].values[0]]
             }
    df1 = pd.DataFrame(data1)

    figure1 = plt.Figure(figsize=(7,7), dpi=50)
    ax1 = figure1.add_subplot(111)
    bar1 = FigureCanvasTkAgg(figure1, root)
    bar1.get_tk_widget().pack(side=tk.LEFT, fill=tk.NONE)
    df1 = df1[['Accidents_by_Age', 'Number_of_Accidents']].groupby('Accidents_by_Age').sum()
    df1.plot(kind='barh', legend=True, ax=ax1,color="hotpink")
    ax1.set_title('Number of Accidents: Age Group')

b4=tk.Button(root, bd=10 ,fg="black",font=('Times New Roman' ,8,'bold'), bg="powder blue",text= "ACCIDENT CLASSIFICATION BASED ON AGE?", command=lambda:query4())
b4.pack()

def query3():
    frameChartsLT = tk.Frame(root)
    frameChartsLT.pack()

    stockListExp = ['mg road','panvel','church street']
    stockSplitExp = [q3.loc[0][1],q3.loc[1][1],q3.loc[1][1]]

    fig = Figure(figsize=(4,4), dpi=50) # create a figure object
    ax = fig.add_subplot(111) # add an Axes to the figure

    ax.pie(stockSplitExp, radius=1, labels=stockListExp,autopct='%0.2f%%', shadow=True,)

    chart1 = FigureCanvasTkAgg(fig,frameChartsLT)
    chart1.get_tk_widget().pack()

b3=tk.Button(root, bd=10 ,fg="black",font=('Times New Roman' ,8,'bold'), bg="powder blue",text= "AREA WITH HIGHEST NUMBER OF ACCIDENTS??", command=lambda:query3())
b3.pack()

root.mainloop()